[
    { "title":"Obama: New bill will prevent 'breakdown in our financial system'",
      "article":"New regulations on Wall Street-type financial firms will not only protect consumers, they will help prevent the kind of meltdown that led to a brutal recession and continues to plague the economy, President Obama said today. While a number of factors led to such a severe recession, the primary cause was a breakdown in our financial system, Obama said before signing the financial reform bill, further citing antiquated and poorly enforced rules that allowed some to game the system and take risks that endangered the entire economy. Obama and Democratic lawmakers held a celebratory ceremony at the Ronald Reagan Building in downtown Washington. The new financial regulations come on top of the health care bill and the $862 billion stimulus package that Obama signed into law earlier in his administration. As Obama put his latest law into effect, Republicans called the new rules an overreaction by government that will burden legitimate businesses. The American people are connecting the dots, said Sente Minority Leader Mitch McConnell, R-Ky.They don't think this bill will solve the problems in the financial sector any more than they think the health care bill will lead to lower costs or better care. Obama highlighted creation of a new consumer protection board, designed to protect people from abuses connected to home mortgages, credit card debt, and college loans. These reforms represent the strongest consumer financial protections in history, Obama said. The new regulation bill will also crack down on complex financial transactions that too often leave taxpayers holding the bag, Obama said. Obama said the new system is designed to make sure that everybody follows the same set of rules, so that firms compete on price and quality, not on tricks and not on traps. But he added that future adjustments may be needed, as our financial system adapts to these new changes and changes around the globe. No law can force anybody to be responsible, Obama said. It's still incumbent on those on Wall Street to heed the lessons of this crisis in terms of how they conduct their businesses. Obama also said, we all stand to gain from these reforms. Republican Party chairman Michael Steele disagreed, saying the new rules will saddle the business community with innumerable unintended consequences, tighter credit, and countless job-killing regulations."
    },
    { "title":"Obama again protests 'Republican obstruction' on jobless benefits",
	"article":"The back-and-forth between President Obama and the Republicans over an extension of jobless benefits goes on, despite the breaking of a GOP filibuster. While the Democratic-led Senate is poised to approve the extension today, the GOP is seeking delay of a final vote, protesting that the new benefits should be accompanied by spending cuts so that the budget deficit won't increase. Obama just put out a statement protesting GOP tactics: A day after the Senate moved forward to pass the unemployment insurance extension to help millions of Americans fighting to get back on their feet and find work, the partisan minority in the Senate is yet again obstructing passage of this bill. After blocking this aid three separate times over the past weeks, Republicans have once again refused to reach an agreement and allow this bill to come to the floor for a vote quickly so these benefits can be restored. Republican obstruction has already cost 2.5 million Americans essential aid they need to pay their rent, put food on the table, and take care of their kids. By the end of this week, roughly 350,000 more Americans could be added to that number. The livelihoods of nearly 3 million Americans shouldn't hinge on partisan game playing in Washington. This latest move gives the partisan minority thirty more hours to stall in the Senate, but that means thirty more hours of suffering for these hardworking families trying to get by."
        },
    { "title":"Phoenix cop probed over online video opposing Arizona's immigration law",
"article":"Phoenix police officer Paul Dobson is the subject of an internal investigation for posting an online video in which he says he opposes Arizona's new immigration law because it will make me feel like a Nazi out there. Watch the video here. The Arizona Republic says Dobson will likely receive a written reprimand or minor form of discipline for granting the interview without supervisor approval. The case is pending final review. Help rate the media coverage of Arizona's immigration law. To join this two-week project, click here. In the three-minute video, the 20-year veteran of the police department says he is speaking only for himself when he expresses his objections to the new law, which takes effect July 29. I have a great deal of contempt for it, I'm very emotional about it, he says in the clip. The video is produced by the California-based Brave New Foundation and is posted on the its online community Facebook page Cuéntame."
   }
]